lkolbly/cmsis-svd/data/TexasInstruments/LM3S5762.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB0</name>
      <description>Register map for USB0 peripheral</description>
      <groupName>USB</groupName>
      <prependToName>USB0</prependToName>
      <baseAddress>0x40050000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FADDR</name>
          <description>USB Device Functional Address</description>
          <addressOffset>0x00000000</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_FADDR</name>
              <description>Function Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>POWER</name>
          <description>USB Power</description>
          <addressOffset>0x00000001</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_POWER_PWRDNPHY</name>
              <description>Power Down PHY</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_POWER_SUSPEND</name>
              <description>SUSPEND Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_POWER_RESUME</name>
              <description>RESUME Signaling</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_POWER_RESET</name>
              <description>RESET Signaling</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_POWER_SOFTCONN</name>
              <description>Soft Connect/Disconnect</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_POWER_ISOUP</name>
              <description>Isochronous Update</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXIS</name>
          <description>USB Transmit Interrupt Status</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXIS_EP0</name>
              <description>TX and RX Endpoint 0 Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP1</name>
              <description>TX Endpoint 1 Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP2</name>
              <description>TX Endpoint 2 Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXIS_EP3</name>
              <description>TX Endpoint 3 Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXIS</name>
          <description>USB Receive Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXIS_EP1</name>
              <description>RX Endpoint 1 Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP2</name>
              <description>RX Endpoint 2 Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXIS_EP3</name>
              <description>RX Endpoint 3 Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXIE</name>
          <description>USB Transmit Interrupt Enable</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXIE_EP0</name>
              <description>TX and RX Endpoint 0 Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP1</name>
              <description>TX Endpoint 1 Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP2</name>
              <description>TX Endpoint 2 Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXIE_EP3</name>
              <description>TX Endpoint 3 Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXIE</name>
          <description>USB Receive Interrupt Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXIE_EP1</name>
              <description>RX Endpoint 1 Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP2</name>
              <description>RX Endpoint 2 Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXIE_EP3</name>
              <description>RX Endpoint 3 Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IS</name>
          <description>USB General Interrupt Status</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_IS_SUSPEND</name>
              <description>SUSPEND Signaling Detected</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_IS_RESUME</name>
              <description>RESUME Signaling Detected</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_IS_BABBLE</name>
              <description>Babble Detected</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_IS_SOF</name>
              <description>Start of Frame</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_IS_CONN</name>
              <description>Session Connect</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_IS_DISCON</name>
              <description>Session Disconnect</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_IS_SESREQ</name>
              <description>SESSION REQUEST</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_IS_VBUSERR</name>
              <description>VBUS Error</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IS</name>
          <description>USB General Interrupt Status</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x0000000A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_IS_RESET</name>
              <description>RESET Signaling Detected</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>USB Interrupt Enable</description>
          <addressOffset>0x0000000B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_IE_SUSPND</name>
              <description>Enable SUSPEND Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_IE_RESUME</name>
              <description>Enable RESUME Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_IE_BABBLE</name>
              <description>Enable Babble Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_IE_SOF</name>
              <description>Enable Start-of-Frame Interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_IE_CONN</name>
              <description>Enable Connect Interrupt</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_IE_DISCON</name>
              <description>Enable Disconnect Interrupt</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_IE_SESREQ</name>
              <description>Enable Session Request</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_IE_VBUSERR</name>
              <description>Enable VBUS Error Interrupt</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>USB Interrupt Enable</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x0000000B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_IE_RESET</name>
              <description>Enable RESET Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FRAME</name>
          <description>USB Frame Value</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_FRAME</name>
              <description>Frame Number</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EPIDX</name>
          <description>USB Endpoint Index</description>
          <addressOffset>0x0000000E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_EPIDX_EPIDX</name>
              <description>Endpoint Index</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <description>USB Test Mode</description>
          <addressOffset>0x0000000F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TEST_FORCEFS</name>
              <description>Force Full-Speed Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TEST_FIFOACC</name>
              <description>FIFO Access</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TEST_FORCEH</name>
              <description>Force Host Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO0</name>
          <description>USB FIFO Endpoint 0</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO0_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO1</name>
          <description>USB FIFO Endpoint 1</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO1_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO2</name>
          <description>USB FIFO Endpoint 2</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO2_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO3</name>
          <description>USB FIFO Endpoint 3</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>USB_FIFO3_EPDATA</name>
              <description>Endpoint Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVCTL</name>
          <description>USB Device Control</description>
          <addressOffset>0x00000060</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_DEVCTL_SESSION</name>
              <description>Session Start/End</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_DEVCTL_HOSTREQ</name>
              <description>Host Request</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_DEVCTL_HOST</name>
              <description>Host Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_DEVCTL_VBUS</name>
              <description>VBUS Level</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_NONE</name>
                  <description>Below SessionEnd</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_SEND</name>
                  <description>Above SessionEnd, below AValid</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_AVALID</name>
                  <description>Above AValid, below VBUSValid</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_VALID</name>
                  <description>Above VBUSValid</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_DEVCTL_LSDEV</name>
              <description>Low-Speed Device Detected</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_DEVCTL_FSDEV</name>
              <description>Full-Speed Device Detected</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_DEVCTL_DEV</name>
              <description>Device Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFOSZ</name>
          <description>USB Transmit Dynamic FIFO Sizing</description>
          <addressOffset>0x00000062</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXFIFOSZ_SIZE</name>
              <description>Max Packet Size</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_8</name>
                  <description>8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_16</name>
                  <description>16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_32</name>
                  <description>32</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_64</name>
                  <description>64</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_128</name>
                  <description>128</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_256</name>
                  <description>256</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_512</name>
                  <description>512</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_1024</name>
                  <description>1024</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_2048</name>
                  <description>2048</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXFIFOSZ_DPB</name>
              <description>Double Packet Buffer Support</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFOSZ</name>
          <description>USB Receive Dynamic FIFO Sizing</description>
          <addressOffset>0x00000063</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXFIFOSZ_SIZE</name>
              <description>Max Packet Size</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_8</name>
                  <description>8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_16</name>
                  <description>16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_32</name>
                  <description>32</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_64</name>
                  <description>64</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_128</name>
                  <description>128</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_256</name>
                  <description>256</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_512</name>
                  <description>512</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_1024</name>
                  <description>1024</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_2048</name>
                  <description>2048</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXFIFOSZ_DPB</name>
              <description>Double Packet Buffer Support</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFOADD</name>
          <description>USB Transmit FIFO Start Address</description>
          <addressOffset>0x00000064</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXFIFOADD_ADDR</name>
              <description>Transmit/Receive Start Address</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFOADD</name>
          <description>USB Receive FIFO Start Address</description>
          <addressOffset>0x00000066</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXFIFOADD_ADDR</name>
              <description>Transmit/Receive Start Address</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTIM</name>
          <description>USB Connect Timing</description>
          <addressOffset>0x0000007A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_CONTIM_WTID</name>
              <description>Wait ID</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_CONTIM_WTCON</name>
              <description>Connect Wait</description>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VPLEN</name>
          <description>USB OTG VBUS Pulse Timing</description>
          <addressOffset>0x0000007B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_VPLEN_VPLEN</name>
              <description>VBUS Pulse Length</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSEOF</name>
          <description>USB Full-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x0000007D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_FSEOF_FSEOFG</name>
              <description>Full-Speed End-of-Frame Gap</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
